// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
    function pS(a,b) {
        let x = a * b
        return x;
    }
console.log(pS(2, 10));
// - створити функцію яка обчислює та повертає площу кола з радіусом r
    function rS(r) {
        let x = r * r * 3.14;
        return x;
    }
    console.log(rS(5));
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
    function cS(r,h) {
        let x = 2 * 3.14 * r * h + 2 * 3.14 * r * r;
        return x;
    }
console.log(cS(5, 10));
// - створити функцію яка приймає масив та виводить кожен його елемент
    function arr(array){
        for (let item of array){
            console.log(item)
        }
    }
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
    function pC(paragraph){
        document.write(`<p>${paragraph}</p>`)
    }
    pC('asdfjasfjs')
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
    function ulCreator(text){
        document.write(`<ul>
            <li>${text}</li>
            <li>${text}</li>
            <li>${text}</li>
        </ul>`)
    }
    ulCreator('Hello')
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
    function ulCreator2(p,num){
        document.write(`<ul>`)
        for (i = 0; i < num; i ++){
        document.write(`<li>${p}</li>`)
        }
        document.write(`</ul>`)
    }
    ulCreator2('qwe', 5)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250